[
  {
    "title": "Chłopi",
    "description": "„Chłopi” to film zrealizowany w technice animacji malarskiej, która podbiła serca fanów na całym świecie przy poprzedniej produkcji studia – filmie „Twój Vincent”. Historia filmu oparta jest na powieści Władysława Reymonta, który w 1924 roku otrzymał Literacką Nagrodę Nobla wyprzedzając Thomasa Manna, George'a Bernarda Shawa i Thomasa Hardy'ego.",
    "runtime": 116,
    "releaseYear": 2023,
    "poster": "https://fwcdn.pl/fpo/79/62/857962/8095499.3.jpg",
    "trailer": "https://www.youtube.com/embed/rILKSimhfA4?si=yYqVGfCC2j5bym4w",
    "genres": [
      {
        "name": "Dramat"
      },
      {
        "name": "Animowany"
      }
    ]
  },
  {
    "title": "Napoleon",
    "description": "„Napoleon\" to monumentalne widowisko, przedstawiające drogę do władzy jednej z najbardziej znaczących postaci światowej historii - Napoleona Bonaparte, w którego rolę wcielił się laureat Oscara Joaquin Phoenix.",
    "runtime": 158,
    "releaseYear": 2023,
    "poster": "https://fwcdn.pl/fpo/49/85/864985/8096488.3.jpg",
    "trailer": "https://www.youtube.com/embed/d9E8K405PRM?si=aC_C6lGBrWo98MlT",
    "genres": [
      {
        "name": "Dramat"
      },
      {
        "name": "Historyczny"
      }
    ]
  },
  {
    "title": "Chłopcy z ferajny",
    "description": "Kilkunastoletni Henry i Tommy DeVito trafiają pod opiekę potężnego gangstera. Obaj szybko uczą się panujących w mafii reguł.",
    "runtime": 146,
    "releaseYear": 1990,
    "poster": "https://gapla.fn.org.pl/public/cache/P19162-483x700.jpg",
    "trailer": "https://www.youtube.com/embed/2ilzidi_J8Q?si=Uo76iMBpTMqddrt2",
    "genres": [
      {
        "name": "Dramat"
      },
      {
        "name": "Gangsterski"
      }
    ]
  },
  {
    "title": "Akira",
    "description": "Członek gangu motocyklowego zostaje poddany eksperymentom. Chłopak zyskuje dzięki nim wielką moc, nad którą nie jest w stanie zapanować. Akcja rozgrywa się w przyszłości w Tokio i opowiada o przygodach Kanedy, dowódcy gangu motocyklowego i jego przyjaciół. Jeden z nich - Tetsuo - zostaje porwany przez wojsko, które pragnie go użyć przy tajnym projekcie o nazwie Akira. Kaneda postanawia ruszyć mu na ratunek, ale Tetsuo nie jest już tym samym człowiekiem. Po doświadczeniach, które na nim przeprowadzono, zyskał on olbrzymią moc, która może zniszczyć całe miasto.",
    "runtime": 124,
    "releaseYear": 1988,
    "poster": "https://fwcdn.pl/fpo/18/65/31865/8095953.3.jpg",
    "trailer": "https://www.youtube.com/embed/Uc8qM_C1Pgg?si=8xJ07g-KpaqC9Su0",
    "genres": [
      {
        "name": "Anime"
      },
      {
        "name": "Science-fiction"
      }
    ]
  },
  {
    "title": "Godzilla minus one",
    "description": "Japonia po wojnie straciła niemal wszystko. Czy wyniszczony kraj zdoła przetrwać atak Godzilli?",
    "runtime": 125,
    "releaseYear": 2023,
    "poster": "https://de.web.img3.acsta.net/pictures/23/11/14/09/50/3209769.jpg",
    "trailer": "https://www.youtube.com/embed/r7DqccP1Q_4?si=EgN3NP8AXLj6z0Ty",
    "genres": [
      {
        "name": "Akcja"
      },
      {
        "name": "Dramat"
      },
      {
        "name": "Przygodowy"
      },
      {
        "name": "Science-fiction"
      }
    ]
  },
  {
    "title": "Gra w opętanie",
    "description": "Uczennice Samantha i Clara zostają same na Święta w położonym na odludziu szkolnym internacie. Wkrótce staną oko w oko z grupą fanatycznych morderców, którzy w tej zacisznej okolicy zamierzają przeprowadzić krwawy rytuał wezwania demona. Są gotowi zabić każdego, kto może im w tym przeszkodzić. Nie spodziewają się jednak, że dwie nastolatki mogą okazać się bardzo trudnymi przeciwniczkami. Czyja dusza tej nocy zostanie złożona na ołtarzu zła?",
    "runtime": 100,
    "releaseYear": 2023,
    "poster": "https://fwcdn.pl/fpo/21/34/10042134/8094384.3.jpg",
    "trailer": "https://www.youtube.com/embed/BMuDuzdSOrI?si=HUwJCiBPgBExoeXy",
    "genres": [
      {
        "name": "Horror"
      }
    ]
  }
]